## Plans :thumbsup:

Outputs can be viewed in the Terrateam Console [here](https://app.terrateam.io/i/64656857/runs/506bd0b1-9e28-43a6-b35a-9944fb8423c5).

## Terrateam Plan Output :thumbsup:
<details>
  <summary>Expand for plan output details</summary>


## Dir: . | Success :thumbsup:
**Dir**: .
**Workspace**: default
**Success**: :thumbsup:

**Step**: plan
**Success**: :thumbsup:
```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # heroku_addon.database will be created
+   resource "heroku_addon" "database" {
+       app_id            = (known after apply)
+       config_var_values = (sensitive value)
+       config_vars       = (known after apply)
+       id                = (known after apply)
+       name              = (known after apply)
+       plan              = "heroku-postgresql:hobby-dev"
+       provider_id       = (known after apply)
    }

  # heroku_app.app will be created
+   resource "heroku_app" "app" {
+       acm                   = (known after apply)
+       all_config_vars       = (sensitive value)
+       buildpacks            = (known after apply)
+       config_vars           = (known after apply)
+       git_url               = (known after apply)
+       heroku_hostname       = (known after apply)
+       id                    = (known after apply)
+       internal_routing      = (known after apply)
+       name                  = "terraform-heroku-gitops-demo"
+       region                = "us"
+       sensitive_config_vars = (sensitive value)
+       stack                 = (known after apply)
+       uuid                  = (known after apply)
+       web_url               = (known after apply)
+
       organization {
+           locked   = (known after apply)
+           name     = "Platform Engineering"
+           personal = (known after apply)
        }
    }

  # heroku_build.app[0] will be created
+   resource "heroku_build" "app" {
+       app_id            = (known after apply)
+       buildpacks        = (known after apply)
+       id                = (known after apply)
+       local_checksum    = (known after apply)
+       output_stream_url = (known after apply)
+       release_id        = (known after apply)
+       slug_id           = (known after apply)
+       stack             = (known after apply)
+       status            = (known after apply)
+       user              = (known after apply)
+       uuid              = (known after apply)
+
       source {
+           checksum = (known after apply)
+           url      = "https://github.com/hilyas/heroku-terraform-gitops.git/archive/refs/heads/main.tar.gz"
+           version  = "main"
        }
    }

  # heroku_formation.web[0] will be created
+   resource "heroku_formation" "web" {
+       app_id   = (known after apply)
+       id       = (known after apply)
+       quantity = 1
+       size     = "Basic"
+       type     = "web"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

```

</details>

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| . | default | 0.00 | 0.00 | 0.00|
| | **Total** | **0.00** | **0.00** | **0.00** |
</details>

---

To apply all these changes, comment:

```
terrateam apply
```

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
